Revit 2027 API
AnalysisDisplayColorSettings.Colors Method
 Get number of colors, including min, max and intermediate.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Colors()
Public Function Colors As Integer
public:
int Colors()
member Colors : unit -> int
Return Value
Int32
 Number of colors, including min, max and intermediate.
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace